Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON KO>EN The Girl Downstairs.tmx
Source language: ko
Languages: en

source: 2학년 때.
en: during our second year.

source: 더욱… 욕심내면 안 될 사람이란 걸 깨달았습니다.
en: and it became more obvious to me that I should let him go.

source: ㅎㅎㅎ
en: LOL

source: 136화 헤피 엔딩 (2)
en: Episode 136 Happy Ending (2)

source: 바베큐 준비 끝났으니까 맛있게 먹고 놀아요~
en: the barbecue is ready, so please enjoy yourselves!

source: 그댈 앞에~ 두고
en: with you~ before my eyes

source: … 별 건 아니고….
en: it isn’t... much of a story...

source: 진짜 다들 너무…
en: Everyone is being so...

source: 윤택이 부인
en: Yoon’s wife

source: 뭐, 뭐, 뭐, 뭐, 뭐야.
en: Wh-Wh-Wh-What are you talking about?

source: 216 ot 끝나고 집 도착
en: 216 Home after the orientation.

source: 나도 아무 생각 없어야 하는데.
en: I shouldn’t think anything else of this...

source: 부지런들 하다~
en: You guys are busy as bees, aren’t you?

source: 혹시나 나 만나려고 핑계 만든 건가?'
en: “is he trying to come up with excuses to see me?”

source: 응..;;;
en: mm-hm...

source: 아니, 채진이가 기억을 못 해서- 그렇게 얘기 많이 했는데.
en: chloe doesn’t remember! even though you talked so much about her.

source: 뭐, 제일 친한~?
en: We’re pretty tight.

source: 선녀~!!
en: like an angel!!!

source: 000 이라 쓰고 (10) !
en: It’s Written as 000! (10)

source: 그러니 묻지 않고 바라본다.
en: so, I don’t ask anymore.

source: 아무리 봐도 그건 설레서 어쩔 줄 모르던 반응이었는데???
en: she was definitely nervous and didn’t know how to respond to me earlier, right?!!!

source: 호'의 감옥
en: deeply confused

source: 그 답을 들을 수 있던 관계는 끝났고
en: but I’m no longer in a relationship where I can get the answer to that.

source: 앞에 두 개가 있으니까 뒤에도 있지 않을까?
en: The first two exist, so maybe the last one does too.

source: 거의 1년이 다 되어 가는데, 내가 구질구질 해지려면 벌써 그랬어!
en: It’s been almost a year now. You’d have known if I was holding a grudge!

source: 글.그림 민송아
en: Story / Art SongA Min

source: 둘만 있는 거, 짧은 대화, 작은 호의, 다 피하고 있잖아!!
en: You’ve been avoiding being alone with me, you won’t have small talk with me, and you won’t even accept my friendly gestures!

source: 특히나 혹평 리뷰어로 유명한데
en: She was especially famous for her scathing reviews.

source: 응, 가을 축제.
en: Yeah, the fall festival.

source: 그 국수가 네 눈치 본다고 너 갈 때만 가게 음악 바꿔놨을 정도니까.
en: SJ even changed the music whenever you went to his place.

source: 나도~
en: me too!

source: 이원준은 진짜 동네 친구 없어서 아무 생각 없이 저러는 거야..
en: joon’s just calling me over and over because he doesn’t have other friends in this area.

source: 지금은 몇?
en: What’s your new record?

source: 털썩
en: PLOP

source: 비슷한 흐름…
en: to my embarrassing past...

source: 아, 아니 그냥 말이..!
en: Uh, I’m just saying!

source: 놀이공원 표가 생겼는데!
en: my friend gave me amusement park passes!

source: 가자, 콘서트
en: Let’s go to the concert.

source: 없어, 공채.
en: There aren’t any open recruitments.

source: 흡연논란에 관한 대범한 발언들에 팬들은 여러 반응
en: fans have responded in a variety of ways to Lee’s bold statements

source: 아니 그게 그렇게 재밌다면서 꼭 물어보라 하시는데, 역시 너무했지?!
en: He swears it’s going to be fun and made me promise to ask you. Unbelievable, isn’t he?

source: 상영시간
en: SHOWTIMES

source: 개..
en: I’d be a dog...

source: 그러는 넌 뭐 신께 빌어본 적 없어?
en: So you never pray to god?

source: 참, 부모님 홍삼 드셔?
en: Oh, right. Do your parents enjoy red ginseng?

source: 216 잠깐 나올 수 있어?
en: 216 Can u come out for a moment?

source: 원주?
en: wonju?

source: 어!
en: Hey!

source: 삐질
en: SIGH

source: BGM 있습니다
en: sound on for music 🔊

source: 자네!
en: Tell me!

source: 아니, 언제 적 포O몬?
en: what? pocket monster? so suddenly?

source: 대학원 생활보다 긴 회사 생활을 보낸 어엿한 사회인.
en: a member of society who’s been in the workforce for longer than my time in graduate school.

source: 아버지, 지금 저 실험 들어가 봐야 하니까 나중에 전화…
en: Father, I’m going to the lab. I’ll call you later--

source: … 나 도끼병 뭐 그런 거 있나?
en: am I full of myself or something?

source: 지하철입구
en: LOWER LEVEL

source: 특수 대학원이랑 스케줄 비슷하게 나올 것 같은데
en: I think the schedule will be similar to the special graduate school.

source: 그치만,
en: but...

source: 응~?
en: hm?

source: 촤락
en: FLAP

source: 하하, 알았어~
en: Haha, all right.

source: 아~ 앙평 집?
en: Oh, your place at Yangpyeong*?

source: 짠
en: DUN

source: 정말 빠르게 지나간다.
en: ...really flies by.

source: 무난한…아니,
en: Mundane... well, not exactly.

source: 콰광~
en: DA DUN

source: 아이고 귀여워라~~
en: You’re so adorable!

source: 오늘 수고했어~
en: good work today!

source: "요정 같은 건 마음가짐의 문제다
en: “Things like fairies depend on the mind of the thinker.

source: 하하하, 이 악마야~!
en: Hahaha, you devil!

source: 꿀꺽
en: GULP

source: 그러게.
en: I don’t know.

source: 그때 얼마나 놀랐는데!!
en: I was so scared!

source: 하하하하!
en: hahahaha!

source: 호감 있었던 거.
en: like joon a bit?

source: 프린트한 게 눈에 잘 들어온단 말이야.
en: The printed version is much easier to read.

source: 어땠어?
en: so, how was it?

source: … 늬 엄마랑 진짜 고생하면서 너희 키웠어.
en: your mother and I went through a lot to raise you and chloe.

source: 네, 교수님!
en: Yes, professor!

source: 그걸 나중에 술 한잔하면서 얘기할 사람이든 사람들이든 만들어둬라.
en: ...so make a friend or two whom you can talk with about those things.

source: 어?
en: Huh?

source: 뭔가 변한 게 보였어..
en: ...I noticed some changes in you.

source: 진주님!
en: Dear Margo!

source: 오빠가 뭔데???
en: how? what’s so great about you?!!!

source: 나은 씨는 그게 돼?
en: what about you, na-eun?

source: 넌 엄마 앞에서 디 ㅈ 다가 뭐냐...
en: “wasted”? can’t you use nicer words in front of your mother?

source: 허나 그때 내가 간과했던 건
en: But there was some things I didn’t realize back then.

source: 고요한 시간을 가졌던 걸까.
en: ...and spend that moment in silence?

source: 그곳은 저의 자리가 아닙니다.
en: But that’s not where I belong.

source: …아!
en: Oh!

source: 그런데 면접일이 콘서트
en: But the interview is on the same day

source: 너 재수 없어..
en: You’re a prick...

source: 나 뭐 이렇게 많이 샀니.
en: Can’t believe how much stuff I bought.

source: 자소서 쓰기 귀찮다고 편하게 있었지…
en: I just sat back and relaxed because I didn’t feel like writing a cover letter...

source: 큰일이다.
en: I’m screwed.

source: - 누나 다음 주 주말에 시간 있어?
en: are you free next weekend, ira?

source: 놀이터에서 놀다가 팔 부러져서 회사에서 달려가고
en: when you broke your arm at the playground, I left work early to take care of you.

source: 썰 있으면 빨리 풀어봐ㅋㅋ
en: entertain us. now! haha.

source: 너 오는 줄 모르고 마트에서 아무거나 사 왔어!!
en: I didn’t know you’d be here, so I just bought whatever!!!

source: 어서 걸어라~
en: let’s just go.

source: 프로젝트 들어갔으면 이러고 한잔할 시간도 없었을 거야.
en: if you got the project, we wouldn’t have had time to enjoy a beer together like this.

source: 원준&두나, 국수… 나…
en: joon and duna... sj... me...

source: 그만해, 진짜;;////
en: Cut it out, seriously!

source: 뭐 어때.
en: it’s fine.

source: 왜 자꾸 만날 껀덕지가 있는 거야?!
en: how does he always find a reason?!

source: 체력 빼곤 그대로야.
en: Nothing changed except their stamina.

source: 약
en: Pharm

source: 내정 하나 믿고 다른 데 지원서 쓸 생각도 안 했어.
en: I was so confident about the offer that it didn’t even occur to me to apply to other companies.

source: 그곳을 떠나 사는 삶은 절대 제 삶이 될 수 없는 거.
en: The life outside this world could never be my life.

source: 으하핰컄하하하!
en: ahahahakahahah!

source: 거리감 장난 아니라고~
en: so there’s a lot of distance between us!

source: 지금의 위치
en: My fame.

source: 난 배추 할 거고, 영화 시작하겠다.
en: I’ll escort you, my lady. the movie’s about the start.

source: 찰나의 순간이기엔
en: ...were too beautiful...

source: 응, 서늘하니 기분 좋은걸
en: No. The weather’s crisp and nice.

source: 올해 초부터였나?
en: Earlier this year...

source: 뭐 어렵다고.
en: what would be so hard about it?

source: 감사합니다!
en: thank you!

source: 힘냐살다보면그런잏도있는거야
en: cheer up things happen

source: 소식이야 뭐, 안 들릴 날이 있나!
en: and how can we even avoid news about her?

source: 프리랜서니까!
en: I’m a freelancer!

source: 다음엔 알아서 티켓팅 성공해!
en: You’ll have to buy the tickets yourself next time!

source: 그렇게나 설레하면 어떡해요!
en: why are you so nervous about it?

source: 가도 돼?
en: Can I really come?

source: 첫 월드 투어 축하해, 사실 나도 오늘 콘서트 진짜 가고 싶었어
en: Congratulations on your first world tour. I really wanted to come today.

source: 아이고, 요즘 다들 술자리 불러대서 죽을 맛이야.
en: People keep inviting me out for drinks. I’m exhausted.

source: NO 출퇴근!
en: I don’t need to go to an office!

source: 두나 씨, 촬영 들어갈게요~
en: duna, let’s start the shoot.

source: 어렵게 됐어.
en: It didn’t work out.

source: 아무래도 이 학교 프로젝트 진행한 석사면 너무 특정적이라…
en: We can’t hire a grad student who participated in that project...

source: 지금 제가 있는 곳이 태어나면서부터 정해진 '제 자리'라는 거.
en: ...But where I am now is where I was born to be.

source: 우연이 반복되면 운명이라고.
en: that if coincidence keeps repeating itself, it’s fate.

source: 평화 나라에서 OOO만 원?!
en: A couple thousands dollars at Peace World.

source: 궁금해?
en: are you curious?

source: 집?
en: To your house?

source: 뮤비 촬영장에 도착
en: Arrived on set

source: 영화/연극 티켓
en: Movie/Play Tickets

source: 조교 일정, 주말 실험 다 빼주고.
en: They adjusted the weekend schedules for my research assistant work and the experiments.

source: 이두나의 소속사 MS엔터테인먼트 측은 논란이 된 사진의 출처가
en: Lee’s management agency, MS Entertainment, stated that the source of the photos

source: 뭐야, 다들 왜 이렇게 빨리 왔어?
en: Why is everyone so early?!

source: 가 볼게.
en: Bye.

source: ..세상 오래 살고 볼 일이야.
en: you just never know, right, coralie?

source: 나도 이젠 호감인지 호기심인지 아니면 호기로움뿐인지 홋갈린다!
en: I can’t tell if she’s interested, uninterested, or disinterested!

source: 내, 내가 그랬다고?!
en: I-I did?!

source: 내가 어제 준 거!
en: the one I gave you yesterday!

source: 묻고 더블로 가즈아!
en: Let’s double that!

source: 큰 길까진 걸어가자.
en: Let’s walk up to the main road.

source: 진다
en: what

source: 그…
en: uh...

source: 이뤄 갈 것들
en: My future accomplishments.

source: 뇌출혈 생존율이… 재활?
en: What’s the survival rate for brain hemorrhage? Rehabilitation?

source: 맞네~~작년에 자주 뵈었던~~
en: Right! I saw her all the time last year!

source: 형, 정신 차려!
en: Get yourself together!

source: 이원준 / 앞자리 3/ 민송대 대학+원 졸업
en: Joon Lee / Thirty-something / Undergraduate and master’s degrees from Minsong University

source: 잘나가는 스타 전여친이랑도 연락하고,
en: and you still keep in touch with your famous celebrity ex?

source: 그, 그러니까, 그게 자꾸 봤더니;;
en: w-well... th-the more I looked at it...

source: 형 청첩장 나오면 또 불러줘!
en: Let me know once your wedding invitation is ready!

source: 태림이는 남친이랑 놀기 바빴고,
en: teri was always with her boyfriend.

source: 서윤택이!
en: yoon seo!

source: -에필로그-
en: Epilogue

source: 알아…
en: I know...

source: 경치 보여주고 싶었는데~
en: I wanted to show her the view.

source: 내 말이.
en: I know.

source: 왜 그래 징그럽게.
en: You’re being cringey.

source: 우리 원주 놀러갔던 거 -
en: when we visited wonju?

source: 그 진주가 그 진주였다고???
en: that’s the margo you were talking about?

source: 쪼르르르
en: TRICKLE

source: 무슨 일~?
en: What do you want?

source: 미안… 일출… 못… 과음..
en: sorry... the sunrise... I can’t... I drank...

source: 예상치 못한 스케줄이 생겼다.
en: I got an unexpected project.

source: 입니다…
en: the concert...

source: 그냥 친구라면 섭섭하지.
en: Not just any kind of friend.

source: 사는 게 참 쉽지 않아도 내 사람들이랑 살아가면
en: life isn’t easy, but if you live it with people who are important to you...

source: 누나 저기, 내가 오늘 면접이 있었는데
en: I had an interview today, and...

source: 가랏, 이라최!
en: I choose you, ira choi!

source: 뭐?!
en: What?!

source: …해….
en: ...tulations...

source: 응~
en: I have!

source: 3단 거절
en: three levels of rejection

source: 머리 잘랐어?
en: did you cut your hair?

source: 연락 오고..
en: They call me...

source: 집들이 재밌었어~!
en: I had fun tonight!

source: 대리비는 벌고 싶었는데~
en: it’d be nice if we can at least pay for the cab with this.

source: KO였다.
en: it was a complete ko.

source: 없어~ 알아서 잘 사는 걸~ 없지~
en: Nope. I do well on my own.

source: 뭐, 뭐야.
en: wh-what?

source: 아, 펌도?
en: and permed it too?

source: 싫다고!
en: stop!

source: 영화 볼래?
en: want to see a movie with me?

source: 내가 진주 누나 없이 누나랑 한잔하는 날이 오다니.
en: who knew I’d end up sitting with you for a drink without margo?

source: BGM 또 있습니다
en: sound on for music again 🔊

source: 이슬
en: JU

source: 000.{j}이라 쓰고(2)!
en: It’s Written as 000! (2){j}

source: 같이 가자!!
en: Let’s go together!

source: 혹시 나한테 관심이?'
en: “is he interested in me?”

source: 왔냐~
en: Here you are!

source: 자리 여기 깔까?
en: should we sit here?

source: 없어야…
en: nothing...

source: 반신마비/뇌출혈
en: Hemiplegia/Brain hemorrhage

source: *80화
en: *refer to episode 80

source: 그거 다 이채진 무용담 아녜요?
en: wasn’t that all chloe?

source: 이게 소위 말하는 밀당?
en: then is she playing hard to get?

source: 내 프로젝트 XX 기업 바뀐 이사님은 크게 문제 삼으셨다고.
en: But the new director of the company that sponsored my project made an issue out of it.

source: 귀엽다.
en: how cute.

source: 뇌출혈?!
en: A brain hemorrhage?!

source: 오~
en: oh!

source: 꼭 갈 거야!
en: I’m definitely going!

source: 나도 이제 서른.
en: I’m thirty now.

source: 미안하다 엄마 아들아.
en: sorry, son of my mom...

source: 취해서 남의 남자 붙잡고 우는 거,
en: ...she got drunk and clung onto another guy.

source: 역시 답은..
en: so the solution...

source: 휙휙휙
en: WHISH WHISH WHISH

source: 하늘이 이미 핑크 색인 걸!!!!
en: the whole world is already pink!!!!

source: 근데 다들 이해는 하니까 암 말도 안 했어.
en: But no one said anything because everyone understood.

source: 잘 됐다.
en: I’m glad I ran into you.

source: 불행하고 치열할 뿐이라도
en: It could be miserable and cut-throat...

source: 다음 화
en: next episode

source: 이두나 WORLD TOUR
en: Duna Lee WORLD TOUR

source: 별 쓸 데 없는 소릴 다 한다!
en: that’s enough nonsense, chloe!

source: -에.에필로그-
en: -Epilogue-

source: 앞에 꿈쩍도 안 하는데 어떻게 가!
en: How am I supposed to move when the car before me is staying still!

source: 5장이나~~ 두나가 준 거야?
en: Five tickets! Did Duna give you these?

source: 제본은 어디 맡기지?
en: I wonder where I can get the binding done.

source: 그만 웃어!
en: I said stop!

source: 프리미엄 붙어서..
en: It cost extra...

source: 그렇게 말하니까 이상하잖아!!
en: that makes it sound even stranger than it is!!!

source: 후유증이 남는다고?!
en: There can be lingering complications?!

source: 월요일 개쓰레기
en: mondays suck

source: 잠깐, 이거 얼마짜리야?
en: Wait, how much does this cost?

source: 띠리링
en: RING

source: 거기 간 멤버가 태림이 커플이랑,
en: the group on that trip was teri and her boyfriend...

source: 저거~ 연예인 OO 결혼 한대잖아.
en: did you hear? those celebrities are getting married.

source: 아~~!
en: Oh!

source: 긁적
en: SCRATCH

source: 고마워.
en: Thanks.

source: 언젠가 이 모든 인연에도 진짜 엔딩이 찾아오겠지만
en: even this relationship might eventually come to an end one day.

source: 엄마 지금 수술 중이야..
en: Your mother is undergoing surgery right now...

source: 병원 가보라고 말씀드렸었나?
en: Did I remember to urge her to get tested?

source: 내일 졸업 논문 계획서 초안 내야 하나.
en: I need to submit the first draft of my graduation thesis tomorrow.

source: 뇌출혈
en: Brain hemorrhage

source: 이번에 지원하신 프로젝트 대상자 자격에 미달하여 최종 심사에서 탈락되었음을 알립니다.
en: We regret to inform you that you were not eligible to participate in this project.

source: 이렇게 챙겨주니 정말 고마운걸…
en: ...but it’s kind of her to hook us up like this.

source: 그리고 때때로 추억해야지.
en: and I’ll reminisce every now and then...

source: 연구실 법인 카드 사용 내역이 문제가 되었다.
en: There was a problem with the spending history of my lab credit card.

source: 슬슬 진심으로 말려야 하지 않을까
en: We should seriously stop her, don’t you think?

source: 탕
en: THUD

source: 부디
en: Please...

source: 잠깐 만나자
en: We need to meet.

source: 질병정보 전체 기본정보 동영상
en: About the disease Overview Summary Video

source: 완전 멀쩡해~ 경치 그렇게 좋다며.
en: I’m totally fine! and I hear the view is beautiful.

source: 퉁퉁
en: PUFFY

source: 진주 맞지?
en: it’s margo, right?

source: 제가 그의 곁으로 가서 그의 기쁨이 될 순 있지만
en: I can go to his side and become his happiness...

source: 불러줘!
en: read them to me!

source: 꽤나 가슴 아프고
en: and felt blue at times...

source: 그런 얘길 기억하고 있었구나…
en: he remembers what I said...

source: 고!
en: go!

source: 아, 노천?
en: Oh, the outdoor event?

source: 팡
en: POOF

source: 누, 누나!
en: I-Ira!

source: 마지막 자유!!
en: ...enjoy your last moment of freedom!!!

source: 어, 으응, 안녕.
en: Uh, yeah. Bye.

source: 오, 8점~!
en: Hmm, 8 points!

source: 이 사람이 너무 좋아!
en: ...because I like him too much!

source: 쌩
en: SHOOM

source: 혼자 학점 망하거나, 내 몸뚱이 다쳐오는 것과는 차원이 달랐다.
en: It was different from screwing up my own GPA or getting myself hurt.

source: 그, 그치?
en: r-right?

source: 이거지!
en: is this!

source: 콘서트 30분 남았는데!!
en: The concert is in 30 minutes!

source: 분량 조절 장엄하게 실패-!
en: Totally went over episode length limit!

source: MUST약국
en: MUST Pharmacy

source: 두둥
en: DA DUN

source: 티켓팅도 해봤는데 안 되더라.
en: I tried to buy the tickets, but it wasn’t possible.

source: 딱
en: SMACK

source: 스윽
en: SWISH

source: 진짜 나온다!
en: there really are potatoes!

source: -두근두근 누라리스트-
en: - Pit A Pat Nunalist -

source: 젖먹이 열난다고 한 밤중에 응급실 가고
en: we rushed to the hospital because you had a fever as a little newborn.

source: 누가 말려.
en: Who’s going to do that?

source: 모오오옥 까아아아
en: fooorwaaard, oooee!

source: … 그래도 둘이 고생하면 말이야,
en: if you overcome all those struggles with someone...

source: 지금 별처럼 높은 곳에서 빛나고 있다.
en: ...has become a shining star.

source: 주책이야!
en: stay out of it!

source: 팟
en: WHOOSH

source: 아니, 언제 적 무ㄷ 무비x3?
en: what movie is that from?!

source: 바나나 산 거 밑에 둬서 다 뭉개졌네, 아~~
en: I put them on top of the bananas and now they’re smashed. Ugh.

source: 동네 살던 선후배, 동기들은 대부분 사회인이 되었고,
en: Most of the alums who used to live in this neighborhood had started working.

source: … 과거의..{j}과오와..
en: that’s too similar...{j}

source: 알면서도 왜 실수하는 걸까.
en: Why did I do that? I know better.

source: 모두 따듯한 말을 건넸다.
en: Everybody was super supportive.

source: 예쁜데 성격까지 좋은 현여친도 있는 거야??
en: all while you have a girlfriend who’s all nice and pretty, right now?!

source: 판매자정보
en: Seller Info

source: 음…'남친 있다' 정도면 괜찮을까요.
en: Um... Would “I have a boyfriend” do?

source: 그럼에도 예상보다 좋다.
en: still, everything’s better than I expected.

source: 저분 그분 아냐?
en: Isn’t she that girl?

source: 저거 두나 아냐?
en: Isn’t that Duna?

source: … .죽여버리고 싶은디?
en: ...want to kill him.

source: 내가 살게!
en: It’s on me!

source: 아니, 어느 세계에서!
en: no way! that makes no sense!

source: 평생 바다를 곁에 두고 살아왔지?!
en: You grew up in a seaside town all your life, didn’t you?!

source: 맨 정신에 부르라고?!
en: A song? While I’m sober?!

source: 백…수?
en: Un...employed?

source: 하렘 만화 주인공…?
en: are you the main character of a harem cartoon or what?

source: 갈 때 키조개 1키로 들고 가고.
en: And take two pounds of pen shell when you leave.

source: 연구비 사용…
en: The spending of the research expenses...

source: 매주 만나야 하는 XX 기업 사수님
en: I had to see the supervisor from the company every week.

source: 왜 빼고 갔어!
en: you all went without me?!

source: - 이라 최 해피 타임 시동 거는 중 -
en: ira choi’s happy time is about to start

source: 진짜야??
en: seriously?!

source: 말 그대로 꿔다 놓은 보릿자루였달까.
en: it felt like I literally didn’t belong there.

source: 사연 있는 원준이~ 잊어!!!
en: Joon’s got a history. Forget about her!

source: 완전 예뻤는데~
en: you were so pretty!

source: 윤택 오빠 친구들 중 제일 괜찮은 사람들있는데, 원준 씨 그렇게 깔끔하지 못하면~
en: You were the nicest of yoon’s friends, but if you can’t come clean like that...

source: 지금까지 축적된 해결과 극복의 경험들은
en: ...but overcoming all the obstacles until now...

source: 소매에서 살짝 나온 맨살 닿았다고?!
en: is it because my hand came in contact with your bare arm?!

source: 따닥 다닥
en: TAP TAP

source: 괜찮아..{j}꽤나..
en: looking really good!{j}

source: 그렇게 여기저기 뛰다 보니,
en: And before I knew...

source: 원준아, 여기~!!
en: Joon, over here!

source: 나 설마…
en: Does that mean...

source: 태림아, 기억나?
en: teri, do you remember?

source: … 야식이라도 사 오자.
en: I should get her some evening snacks...

source: 드라이라도 받고 올까 했는데 영화 시간이;;
en: I wanted them to style it for me, but I would’ve been late for the movie...

source: 그때 내 남친이 누구더라.
en: my boyfriend? who?

source: 어우 팀장님!
en: oh!

source: 채진이는 평일 내내 있는데 나는 주말 잠깐 들르면서 그 와중에 짜증까지…!
en: Chloe has been there every weekday. I only visit on weekends. How can I get grumpy?!

source: 기껏 몇 없는 동네 친구인데… 서운해.
en: You’re one of the few friends I have in this neighborhood... It makes me sad.

source: 미래는 별로 두렵지 않았다.
en: ...and I wasn’t afraid of the future.

source: … 뭐.
en: what?

source: 드물수록 좋은 게 호적메이트라…
en: people on the same family register are meant to be seen less often...

source: 퇴근 일찍할 테니까 영화 보고 맥주 어때?
en: I’ll be off from work early. how about a movie and a beer?

source: 아유, 아저씨도 같이 한 잔…
en: haha, maybe this old man should have a drink with--

source: 내가..
en: too much...

source: 웃지 마~!
en: stop laughing!

source: 원주에서!
en: In Wonju!

source: 전요~
en: I...

source: 내일 애들한테 그것도 물어봐야겠다.
en: I should ask my friends tomorrow.

source: 여전히 서로를 위하고 있다.
en: And we still care for one another.

source: 이원준 스티커를 보냈습니다 / 7분전
en: Joon Lee sent an emoji. / 7 minutes ago

source: 이것이 바로 국힙 '두'탑
en: no one can “do” like duna does!

source: 마시자~!
en: Let’s drink!

source: 내 마음도 그때와는 많이 달라졌다.
en: my heart is very different from back then as well.

source: 앗;ㅋㅋㅋㅋ
en: oh, ha... haha...

source: 짠~!
en: Ta-da!

source: 내가 이원준한테 좀..
en: that I used to...

source: 얘, 얘, 얘 자꾸 이러면!
en: i-i-if... if he keeps going like this-!

source: 끝나고 한잔하다.
en: Let’s grab a drink when you’re done.

source: 네 첫사랑.
en: your first love.

source: 고마워~~누난 천사야!
en: Thank you. You’re an angel!

source: 윤택 오빠… 은근 옛날부터 두나한테 들이댔었지..
en: and yoon... he kept trying to hit on her all the time...

source: 맥주?
en: Beer?

source: 까악?!
en: eeek!

source: 가족회의 하고 왔어.
en: we had a family meeting.

source: 그러니
en: Therefore...

source: 교수님?!
en: Professor?!

source: 난 내 눈으로 확인 안 한 건 안 믿어.
en: I don’t believe anything I haven’t witnessed with my own eyes.

source: 삑
en: BEEP

source: 뭐어…
en: What...?

source: 미안하다, 아빠 아들!
en: sorry, son of my dad!

source: 이번 주 번호 떴어?
en: are this week’s numbers released yet?

source: 누나 말대로 노예 계급 달기 전 마지막 자유 시간인데 같이 술 마실 사람이 없네.
en: like you said, this is my last moment of freedom before I officially become a slave at my company.

source: 막힌다!
en: I got caught up in traffic!

source: 무슨 일이세요?
en: How can I help you?

source: …네…
en: I see...

source: 내 친구랑 그런다고 생각하니까 토 나오는디?
en: the thought of doing anything like that with a friend makes me barf.

source: 아마 그건 PINK!{j}정말 말도 안↗︎ 되게~↘︎ 이젠 친구로 보이지~ 않아~~ 지!!
en: it’s a “it’s probably pink! it really makes↗︎ no sense~↘︎ now I can’t see you~ as a friend~~”{j}

source: 근데 공주님은 심기 좀 불편하다고 바로,
en: but when that princess was upset over something little...

source: 해는 벌써 떠버렸다~
en: the sun’s already up.

source: 푸들!{j}키링!
en: it’s the poodle keychain!!!{j}

source: 하하, 고마워.
en: haha, thanks.

source: 끼어들지 말아요!
en: Don’t cut in front of me!

source: 여보세요?
en: Hello?

source: 그 시절의 누나에겐 뭐가 간절했던 걸까.
en: I wonder what duna wanted so desperately back then.

source: 6시간에 걸친 응급 수술은, 다행히 성공적이었다.
en: Thankfully, the six-hour-long emergency operation was a success.

source: 포기하기엔…
en: I can’t give up...

source: 요즘은 좋으면 싫다고 하는 게 유행인가?
en: or is the trend nowadays to say “no” if she likes him?

source: 두나가 상대여서 정말 다행이었어.
en: it was a good thing duna was my rival.

source: 파바바바박
en: WHISH WHISH SWISH

source: 너도 회사 생활하면 더 힘들어질 텐데,
en: things will get hard for you as you start working...

source: 하하
en: haha!

source: 따닥
en: TAP

source: 생일 그리 챙기지도 않는데, 무슨.
en: You never care about birthdays.

source: 무슨 얘기 했어?
en: what did she say?

source: 야~!
en: hey!

source: 어라?{j}잠깐.
en: {j}Wait a second.

source: 원준아
en: Joon.

source: 많이 아프지 않기를
en: Don’t let it hurt too much.

source: 자유이용권
en: Season Pass

source: 머쓱
en: EMBARRASSED

source: 후후, 좋은 거 줄까?
en: Hehe, ready to see something awesome?

source: 아아!!
en: Argh!

source: 지금?
en: Right now?

source: 누구 생일인가?
en: Is it someone’s birthday?

source: 썸 많이 생기는 곳이지.
en: a lot of people hit it off there...

source: 무비무비무비!!!
en: move it, move it, move it!!!

source: … 궁금한 게 참 많은데 뭐 하나 물어보기 쉽지 않다.
en: I have so many questions... but it isn’t easy to ask.

source: 그림 민송아
en: Art SongA Min

source: 미리 알았다면 '이슬처럼' 말고,
en: if I’d known sooner, I wouldn’t have gotten like dew.

source: 역시 무난하게 잘 불러서 노잼이야.
en: That was too normal. No fun.

source: 유령?!
en: Ghosts?!

source: 우당탕
en: TUMBLE

source: 하지만 말이에요 그렇다고
en: But even so...

source: 찰나보다 조금 더 긴 시간이 되었으면 하는
en: on those days that I hope are more than just fleeting moments.

source: 그만 피해다녀!
en: Quit avoiding me!

source: 노래 듣고 광고 사진 보고 기사 읽는 거
en: is it okay for you listen to your ex’s songs, see her ads, and read about her in the news?

source: 더욱 그가 사랑스러워졌고
en: It made me love him even more...

source: 엄마 병원도 지금이랑 거리 차이 별로 없어.
en: and the drive to your mother’s hospital is about the same as it is here.

source: 단호하게.
en: firmly.

source: 절대 도착 못 해!!
en: I can never make it!

source: 감자 줄기
en: potato plants
